OpenFOAM/installationsWithAdditionalTools/openfoam-5.x_CFDEM/03_testCases/enzu_test/CFD.base/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
87615
(
(-0.033323764 -0.030996001 0.18120643)
(-0.057385923 -0.053190426 0.42553123)
(-0.032230088 -0.041341592 0.51029688)
(-0.014033776 -0.037348003 0.60733095)
(-0.025330385 -0.055140886 0.75633416)
(-0.041172283 -0.07141572 0.9621737)
(-0.04001476 -0.068901416 1.1494842)
(-0.035586288 -0.054222814 1.2608226)
...
)
;

boundaryField
{
    WALL
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    cyclic_in
    {
        type            cyclic;
    }
    cyclic_out
    {
        type            cyclic;
    }
}


// ************************************************************************* //
